[
  {
  "id": 1,
  "title": "Free Courses with Certificates",
  "description": "A curated collection of free online courses offering certificates across various domains.",
  "category": "Education / Resources",
  "techStack": ["HTML", "CSS", "JavaScript", "Tailwind CSS", "GitHub Pages"],
  "github": "https://github.com/avinash201199/Free-courses-with-Certificates",
  "live": "https://free-courses-with-certificates.netlify.app/",
  "image": "/projects/free-courses-with-certificates.jpg",
  "contributors": ["Avinash Singh"],
  "featured": true,
  "fullDescription": "This repository offers a comprehensive list of free online courses that provide certificates upon completion. It serves as a valuable resource for individuals seeking to enhance their skills and showcase their achievements. The project is open for contributions, allowing others to add more courses and improve the repository's structure."
},
  {
  "id": 2,
  "title": "MemeGenerator",
  "description": "A React-based web application that allows users to create and customize memes.",
  "category": "Web Development / Fun Projects",
  "techStack": ["React", "Tailwind CSS", "Vite", "Vercel"],
  "github": "https://github.com/avinash201199/MemeGenerator",
  "live": "https://meme-generator-three-psi.vercel.app/",
  "image": "/projects/meme-generator.jpg",
  "contributors": ["Avinash Singh"],
  "featured": true,
  "fullDescription": "MemeGenerator is a web application built with React and styled using Tailwind CSS. It enables users to create memes by selecting images and adding custom text. The application is designed to be user-friendly and responsive, providing a seamless experience across devices."
}
,
  {
  "id": 3,
  "title": "Weather App",
  "description": "A simple weather application built using HTML, CSS, and JavaScript that fetches real-time weather data from the OpenWeather API.",
  "category": "Web Development / APIs",
  "techStack": ["HTML", "CSS", "JavaScript", "OpenWeather API"],
  "github": "https://github.com/avinash201199/weather-app",
  "live": "https://avinash201199.github.io/weather-app/",
  "image": "/projects/weather-app.jpg",
  "contributors": ["Avinash Singh"],
  "featured": true,
  "fullDescription": "This weather application allows users to check the current weather conditions of any city by entering its name. It utilizes the OpenWeather API to fetch real-time data and displays it in a user-friendly interface. The project is designed to help beginners understand how to work with APIs and handle asynchronous data in JavaScript."
},
  {
  "id": 4,
  "title": "Assessing women's safety in Indian cities through Twitter Data Analysis",
  "description": "Focuses on the role of social media in promoting the safety of women in Indian cities with special reference to the role of social media websites and applications like Twitter platform.",
  "category": "Data Analysis / Research",
  "techStack": ["JavaScript", "Flask", "python", "Twitter API"],
  "github": "https://github.com/damarudhvarma/Assessing-women-s-safety-in-Indian-cities-through-Twitter-Data-Analysis",
  "live": "",
  "image": "/projects/women-safety.png",
  "contributors": ["Damarudh Varma"],
  "featured": false,
  "fullDescription": "we use TWEEPY package from python to download tweets from twitter but every time INTERNET will not available to download tweets online so we downloaded MEETOO tweets on women safety and safe inside dataset folder. Application will read the tweets to detect women’s sentiments. "
},
{
  "id": 5,
  "title": "Image Filtering Studio",
  "description": "An interactive web app that lets users apply various filters and transformations to images in real time.",
  "category": "Machine Learning",
  "techStack": ["Python", "Flask", "OpenCV", "HTML", "CSS", "JavaScript"],
  "github": "https://github.com/Vidhi-bhutia/Image-Filtering-Studio",
  "live": "https://image-filtering-studio.onrender.com/",
  "image": "/projects/image-filtering-studio.png",
  "contributors": ["Vidhi Bhutia"],
  "featured": false,
  "fullDescription": "Image Filtering Studio is a web-based application that allows users to upload images and apply a variety of filters and enhancements, such as grayscale, blur, edge detection, and more. Built with Flask and OpenCV, it processes images efficiently and provides instant visual feedback. The project demonstrates skills in image processing, web integration, and UI interactivity."
}
,
{
  "id": 6,
  "title": "Loan-Application",
  "description": "An AI-powered loan underwriting & lending app built for rural and semi-urban India, designed to work on low-bandwidth networks and for users with low digital literacy.",
  "category": "Flutter / AI/ML",
  "techStack": ["Flutter","FastAPI","LLM","PostgreSQL","Redis","Twilio","AWS"],
  "github": "https://github.com/ArpitGupta4957/loanApplication",
  "live": "https://drive.google.com/file/d/18yEdvIJS89ykl4VfPGOg5XrSOso-Fk2y/view?usp=drive_link",
  "image": "/projects/loap-Application.jpg",
  "contributors": ["Arpit Gupta"],
  "featured": false,
  "fullDescription": "GrameenLend is your personal financial companion app that blends AI-driven credit scoring, SMS chatbot support, and instant disbursements to make small-ticket personal loans accessible, fast, and transparent."
},
  {
  "id": 7,
  "title": "MyFlix - Video Playback Website",
  "description": "A simple movie and TV series streaming site with interactive video cards and language-based filters.",
  "category": "Web Development",
  "techStack": ["HTML5", "CSS3", "JavaScript"],
  "github": "https://github.com/Vidhi-bhutia/MyFlix-Video-Playback-website",
  "live": "https://vidhi-bhutia.github.io/MyFlix-Video-Playback-website/",
  "image": "/projects/myflix-video-playback.jpg",
  "contributors": ["Vidhi Bhutia"],
  "featured": false,
  "fullDescription": "MyFlix is a front-end movie streaming website where users can explore trending and most-watched videos categorized by five languages — Hindi, Tamil, English, Malayalam, and Kannada. It features an interactive layout with video cards that allow users to play videos instantly, shortlist favorites, and soon, save videos to a 'Watch Later' list. The interface includes a home navigation button and dynamic category filtering built using JavaScript. Future updates aim to include user authentication and improved responsiveness for all devices."
}
]
